<a href="https://colab.research.google.com/github/michalis0/Business-Intelligence-and-Analytics/blob/master/week2%20-%20Pandas%20and%20Python/walkthroughs/Dataset%20Descriptions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Dataset Descriptions
This notebook contains the descriptions of all the datasets used during the tutorials found within this [Learning Pandas repository](https://github.com/tdpetrou/Learn-Pandas).

### Datasets
* [Employee](#Employee-Data)
* [Stack Overflow](#Stack-Overflow-Data)
* [Food Inspections](#Food-Inspections-Data)

## Helper Function
The below **`create_description_table`** function can help create datasets descriptions for any DataFrame. You must first import each DataFrame in as normal and then pass it to the function. You must also pass it a list of the **`descriptions`** as strings.

In [8]:
def create_description_table(df, descriptions, round_num=2):
    df_desc = df.dtypes.to_frame(name='Data Type')
    df_desc['Description'] = descriptions
    df_desc['Missing Values'] = df.isnull().sum()
    df_desc['Mean'] = df.select_dtypes('number').mean().round(round_num)
    df_desc['Most Common'] = df.apply(lambda x: x.value_counts().index[0])
    df_desc['Most Common Ct'] = df.apply(lambda x: x.value_counts().iloc[0])
    df_desc['Unique Values'] = df.nunique()
    return df_desc

# Employee Data

### Brief Overview
The city of Houston provides information on all its employees to the public. This is a random sample of 2,000 employees with a selection of the more interesting columns. For more on [open Houston data visit their website](http://data.houstontx.gov/). Data was pulled in December, 2016.

In [9]:
import pandas as pd

In [10]:
employee = pd.read_csv('https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week2%20-%20Pandas%20and%20Python/Pandas/data/employee.csv', parse_dates=['HIRE_DATE', 'JOB_DATE'])
employee.head()

                POSITION_TITLE  ...   JOB_DATE
0  ASSISTANT DIRECTOR (EX LVL)  ... 2012-10-13
1            LIBRARY ASSISTANT  ... 2010-09-18
2               POLICE OFFICER  ... 2015-02-03
3            ENGINEER/OPERATOR  ... 1991-05-25
4                  ELECTRICIAN  ... 1994-10-22

[5 rows x 8 columns]

In [11]:
employee.shape

(2000, 8)

In [12]:
descriptions = ['Position', 'Department', 'Base salary', 'Ethnicity', 
                'Full time/Part time/Temporary, etc...', 'Gender', 
                'Date hired', 'Date current job began']

In [13]:
create_description_table(employee, descriptions)

                      Data Type  ... Unique Values
POSITION_TITLE           object  ...           330
DEPARTMENT               object  ...            24
BASE_SALARY             float64  ...           791
ETHNICITY                object  ...             6
EMPLOYMENT_TYPE          object  ...             5
GENDER                   object  ...             2
HIRE_DATE        datetime64[ns]  ...           999
JOB_DATE         datetime64[ns]  ...           947

[8 rows x 7 columns]

# Stack Overflow Data
This data was gathered from the [Stack Exchange data explorer](https://data.stackexchange.com/), an excellent tool to get almost any data you want from any of the Stack Exchange sites.

This particular dataset was collected December 7, 2017 with [this query](http://data.stackexchange.com/stackoverflow/query/768430/get-all-questions-and-answerers-from-tag). You'll have to run the query twice to get all the data because the query exceeds 50,000, the maximum allowable number of rows. Switch the inequality on the **`creationdate`** in the `where` clause to do so.

In [ ]:
so = pd.read_csv('https://github.com/michalis0/Business-Intelligence-and-Analytics/blob/master/week2%20-%20Pandas%20and%20Python/Pandas/data/stackoverflow_qa.csv?raw=true')
so.head()

        id         creationdate  score  ...  quest_rep         ans_name  ans_rep
0  5486226  2011-03-30 12:26:50      4  ...      125.0  Mike Pennington  26995.0
1  5515021  2011-04-01 14:50:44      8  ...     3301.0  Mike Pennington  26995.0
2  5558607  2011-04-05 21:13:50      2  ...     3301.0     Wes McKinney  43310.0
3  6467832  2011-06-24 12:31:45      9  ...      117.0     Wes McKinney  43310.0
4  7577546  2011-09-28 01:58:38      9  ...      958.0             HYRY  54137.0

[5 rows x 12 columns]

In [ ]:
so.shape

(56398, 12)

In [ ]:
descriptions = ['Question ID', 'Creation date', '# of question upvotes', 'View count',
                'Question Title', 'Number of Answers', 'Number of comments for Question',
                'Number of favorites for Question', 'User name of question author',
                'Reputation of question author', 'User name of selected answer author',
                'Reputation of selected answer author']

In [ ]:
create_description_table(so, descriptions)

              Data Type  ... Unique Values
id                int64  ...         56398
creationdate     object  ...         56378
score             int64  ...           159
viewcount         int64  ...          5978
title            object  ...         56392
answercount       int64  ...            19
commentcount      int64  ...            26
favoritecount   float64  ...            81
quest_name       object  ...         19848
quest_rep       float64  ...          2668
ans_name         object  ...          4907
ans_rep         float64  ...          2648

[12 rows x 7 columns]

# Food Inspections Data

In [ ]:
food_inspections = pd.read_csv('https://raw.githubusercontent.com/michalis0/Business-Intelligence-and-Analytics/master/week2%20-%20Pandas%20and%20Python/Pandas/data/food_inspections.csv', parse_dates=['Inspection Date'])
food_inspections.head()

                    DBA Name  ...                                         Violations
0               DANY'S TACOS  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
1      BILLY FOOD MARKET INC  ...                                                NaN
2  TAQUERIA HACIENDA TAPATIA  ...  2. FACILITIES TO MAINTAIN PROPER TEMPERATURE -...
3     WILD GOOSE BAR & GRILL  ...  16. FOOD PROTECTED DURING STORAGE, PREPARATION...
4         PUBLICAN TAVERN K1  ...  18. NO EVIDENCE OF RODENT OR INSECT OUTER OPEN...

[5 rows x 9 columns]

In [ ]:
food_inspections.shape

(24063, 9)

In [ ]:
descriptions = ['Doing business as Name', 'Restaurant, Grocery store, School, Bakery, etc...',
                'High/Medium/Low', 'Address', 'Zip Code', 'Inspection Date',
                'Inspection Type', 'Pass/Fail/Out of business, etc...',
                'Detailed description of violations']

In [ ]:
create_description_table(food_inspections, descriptions)

                      Data Type  ... Unique Values
DBA Name                 object  ...         24063
Facility Type            object  ...           392
Risk                     object  ...             4
Address                  object  ...         15320
Zip                     float64  ...            93
Inspection Date  datetime64[ns]  ...          1772
Inspection Type          object  ...            43
Results                  object  ...             7
Violations               object  ...         11679

[9 rows x 7 columns]